{
  "resourceType": "CodeSystem",
  "id": "ObservedFeatureCS",
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/ObservedFeatureCS",
  "version": "0.0.2",
  "name": "ObservedFeatureCS",
  "title": "Observed Feature CodeSystem",
  "status": "draft",
  "date": "2019-11-01",
  "publisher": "Hl7-Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "description": "Observed Feature seen during a breast examination.",
  "caseSensitive": true,
  "content": "complete",
  "count": 26,
  "concept": [
    {
      "code": "ArchitecturalDistortion",
      "display": "Architectural distortion",
      "definition": "Many breast masses are found within the zone of fibroglandular tissue or at a fat-fibroglandularjunction. \r\nIf the mass blurs a tissue plane between fat and fibroglandular tissue or if the mass producesdistortion of the ducts, these findings may be termed architectural distortion. \r\n-- Breast Imaging Reporting and Data System—Mammography, Fifth Edition#139\r\n\r\nValid for the following modalities: MG US MRI."
    },
    {
      "code": "AxillaryAdenopathy",
      "display": "Axillary adenopathy",
      "definition": "Enlarged axillary (under the armpit) lymph nodes. \r\nAdditional evaluation is needed to determine the cause. \r\n-- Breast Imaging Reporting and Data System—Ultrasound, Second Edition#110\r\n\r\nValid for the following modalities: MG MRI."
    },
    {
      "code": "BiopsyClip",
      "display": "Biopsy clip",
      "definition": "Tissue marker placement after image-guided breast biopsy has become a routine component of clinical practice. \r\nMarker placement distinguishes multiple biopsied lesions within the same breast, prevents re-biopsy of benign lesions, enables multi-modality correlation, guides pre-operative localization and helps confirm surgical target removal. \r\nNumerous breast tissue markers are currently available, with varied shapes, composition, and associated bio-absorbable components. \r\nThis review serves to familiarize the breast interventionalist with the tissue markers most widely available in the United States today and to provide guidance regarding selection of appropriate markers for various clinical settings. \r\n-- https://www.ncbi.nlm.nih.gov/pubmed/30059952\r\nValid for the following modalities: MG US MRI."
    },
    {
      "code": "BiopsyClips",
      "display": "Biopsy clips",
      "definition": "Tissue marker placement after image-guided breast biopsy has become a routine component of clinical practice. \r\nMarker placement distinguishes multiple biopsied lesions within the same breast, prevents re-biopsy of benign lesions, enables multi-modality correlation, guides pre-operative localization and helps confirm surgical target removal. \r\nNumerous breast tissue markers are currently available, with varied shapes, composition, and associated bio-absorbable components. \r\nThis review serves to familiarize the breast interventionalist with the tissue markers most widely available in the United States today and to provide guidance regarding selection of appropriate markers for various clinical settings. \r\n-- https://www.ncbi.nlm.nih.gov/pubmed/30059952\r\nValid for the following modalities: MG US MRI."
    },
    {
      "code": "BrachytherapyTube",
      "display": "Brachytherapy tube",
      "definition": "Brachytherapy may be temporary or permanent. \r\nTemporary brachytherapy places radioactive material inside a catheter for a specific amount of time and then it is removed. \r\nIt is given at a low-dose rate (LDR) or high-dose rate (HDR). \r\nPermanent brachytherapy is also called seed implantation. \r\nIt puts radioactive seeds (about the size of a grain of rice) in or near the tumor permanently. \r\nAfter several months, the seeds lose their radioactivity. \r\n-- https://www.radiologyinfo.org/en/info.cfm?pg=brachy\r\nValid for the following modalities: MG."
    },
    {
      "code": "ChestWallInvasion",
      "display": "Chest wall invasion",
      "definition": "A tumor of the lung that has invaded the chest wall.\r\n\r\nValid for the following modalities: MG US MRI."
    },
    {
      "code": "CooperDistorted",
      "display": "Cooper distorted",
      "definition": "Valid for the following modalities: US."
    },
    {
      "code": "CooperThickened",
      "display": "Cooper thickened",
      "definition": "The cooper's ligaments are fibrous bands extending vertically from surface attach on chest wall muscles. \r\nThese ligaments maintain the shape and structure of your breasts and help to prevent sagging. \r\nCooper's ligaments support the breasts on the chest wall, maintain their contour, and keep them in position. \r\nThese support breast tissue; they become contracted in cancer of breast, producing dimples in overlying skin. \r\nThickening occurs when there are skin changes usually associated with the presence of a mass, benign or malignant, that causes shortening in the Coopers ligaments due to fibrosis.\r\n\r\nValid for the following modalities: US."
    },
    {
      "code": "Edema",
      "display": "Edema",
      "definition": "Edema may be due to blockage of subdermal lymphatics by tumor cells or an inflammatory process within the breast or axilla.\r\n\r\nValid for the following modalities: US."
    },
    {
      "code": "EdemaAdj",
      "display": "Edema adj",
      "definition": "Valid for the following modalities: US."
    },
    {
      "code": "GoldSeed",
      "display": "Gold Seed",
      "definition": "Tiny, gold seeds, about the size of a grain of rice, that are put in and/or around a tumor to show exactly where it is in the body. \r\nDoctors are then able to target the tumor directly and give higher doses of radiation with less harm to nearby healthy tissue. \r\nAlso called gold fiducial marker seeds, gold fiducial markers, and gold-seed fiducial markers. \r\n-- https://www.cancer.gov/publications/dictionaries/cancer-terms/def/gold-seeds\r\nValid for the following modalities: MG."
    },
    {
      "code": "Hematoma",
      "display": "Hematoma",
      "definition": "A hematoma is a localized bleeding outside of blood vessels, due to either disease or trauma including injury or surgery and may involve blood continuing to seep from broken capillaries. \r\nen.wikipedia.org > wiki > Hematoma\r\n\r\nValid for the following modalities: MG."
    },
    {
      "code": "NippleRetraction",
      "display": "Nipple retraction",
      "definition": "Retracted nipples lie flat against the areola. \r\nThe condition can be the result of inflammation or scarring of the tissue behind the nipple, and caused by numerous conditions, not just cancer. \r\nIn the case of breast cancer, nipple retraction occurs when the tumor attacks the duct behind the nipple, pulling it in.\r\n\r\nValid for the following modalities: MG MRI."
    },
    {
      "code": "NOChestWallInvasion",
      "display": "NO Chest wall invasion",
      "definition": "The mass has not attached itself to the chest wall.\r\n\r\nValid for the following modalities: MRI."
    },
    {
      "code": "PectoralisMuscleInvasion",
      "display": "Pectoralis muscle invasion",
      "definition": "Pectoralis muscle invasion is when a tumor has become large enough to invade into the pectoralis muscle.\r\n\r\nValid for the following modalities: US MRI."
    },
    {
      "code": "PectoralisMuscleInvolvement",
      "display": "Pectoralis muscle involvement",
      "definition": "Pectoralis muscle involvement of the tumor has been detected on the MRI by muscle enhancement with obliteration of the fat plane between the tumor and the muscle. \r\npubs.rsna.org > doi > pdf\r\n\r\nValid for the following modalities: MRI."
    },
    {
      "code": "PectoralisMuscleTenting",
      "display": "Pectoralis muscle tenting",
      "definition": "The tent sign is a term referring to a characteristic appearance of the posterior edge of the breast parenchyma when a mass (usually an infiltrating lesion) causes its retraction and forms an inverted \"V\" that resembles the tip of a circus tent. \r\n-- https://radiopaedia.org/articles/tent-sign-breast?lang=us\r\nValid for the following modalities: US MRI."
    },
    {
      "code": "PostSurgicalScar",
      "display": "Post surgical scar",
      "definition": "Post surgical scarring happens because of the incisions needed to surgically remove tumor, cells, etc. \r\nThe amount of scarring is connected to the different stages of wound healing. \r\nSurgical scar care should be continued for a year.\r\n\r\nValid for the following modalities: MG."
    },
    {
      "code": "Seroma",
      "display": "Seroma",
      "definition": "A breast seroma is a collection (pocket) of serous fluid that can develop after trauma to the breast or following procedures such as breast surgery or radiation therapy. \r\nSerous fluid is a pale yellow, transparent fluid that contains protein, but no blood cells or pus. \r\n-- https://www.verywellhealth.com/seroma-medical-definition-430372\r\nValid for the following modalities: MG."
    },
    {
      "code": "SkinInvolvement",
      "display": "Skin involvement",
      "definition": "The mass or lesion has attached itself to the skin of the breast. \r\nThere are several layers of skin that the mass or lesion can penetrate and that is what determines the level of skin invasion.\r\n\r\nValid for the following modalities: MG US MRI."
    },
    {
      "code": "SkinLesion",
      "display": "Skin lesion",
      "definition": "A skin lesion is a part of the skin that has an abnormal growth or appearance compared to the skin around it.In order to diagnose a skin lesion, a dermatologist or doctor will conduct a full physical exam.\r\n\r\nValid for the following modalities: MG."
    },
    {
      "code": "SkinRetraction",
      "display": "Skin retraction",
      "definition": "Skin retraction (or inversion) or Skin retraction. \r\nBreast cancers that are located near the skin or nipple may cause scarring within the breast that pulls at the nipple or nearby skin. \r\nSkin and nipple retraction are more obvious when a woman raises her arms above her head or leans forward. \r\n-- https://www.drholmesmd.com/blog/early-signs-of-breast-cancer\r\nValid for the following modalities: MG US MRI."
    },
    {
      "code": "SkinThickening",
      "display": "Skin thickening",
      "definition": "The presence of skin thickening on mammography is variably defined, usually being more than 2 mm in thickness. \r\nIt can result from a number of both benign and malignant causes. \r\n-- https://radiopaedia.org/articles/skin-thickening-on-mammography-differential?lang=us\r\nValid for the following modalities: MG US MRI."
    },
    {
      "code": "SurgicalClip",
      "display": "Surgical clip",
      "definition": "Most surgical clips are currently made of titanium, and as many as 30 to 40 clips may be used during a single surgical procedure. \r\nThey remain inside the patient's body after the wounds are healed.\r\n\r\nValid for the following modalities: MG."
    },
    {
      "code": "SurgicalClips",
      "display": "Surgical clips",
      "definition": "A series of surgical staples or clips are used during surgery. \r\nIn one push of a button the blood supply is cut off to the anatomical part being removed and a staple line is left in the patient and on the side where the pathology has been removed.\r\n\r\nValid for the following modalities: MG."
    },
    {
      "code": "TrabecularThickening",
      "display": "Trabecular thickening",
      "definition": "Trabecular thickening-thickening of the Cooper's ligaments and fibrous stroma-is an imaging finding of breast edema, usually secondary to dilated lymphatics. \r\nSkin thickening and trabecular thickening often occur together, and they have similar differential diagnoses. \r\n-- https://oxfordmedicine.com/view/10.1093/med/9780190270261.001.0001/med-9780190270261-chapter-48\r\nValid for the following modalities: MG."
    }
  ]
}