{
  "resourceType": "CodeSystem",
  "id": "BreastRadMemmoAsymmetriesCS",
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/BreastRadMemmoAsymmetriesCS",
  "version": "0.0.2",
  "name": "BreastRadMemmoAsymmetriesCS",
  "title": "Mammo Asymmetries CodeSystem",
  "status": "draft",
  "date": "2019-11-01",
  "publisher": "Hl7-Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "description": "Codes defining types of mammography asymmetries.",
  "caseSensitive": true,
  "content": "complete",
  "count": 4,
  "concept": [
    {
      "code": "Asymmetry",
      "display": "Asymmetry",
      "definition": "This is an area of fibroglandular-density tissue that is visible on only one mammographic projection.\r\nMost such findings represent summation artifact, a superimposition of normal breast structures,\r\nwhereas those confirmed to be real lesions (by subsequent demonstration on at least one\r\nmore projection) may represent one of the other types of asymmetry or a mass.\r\n    -- Bi-Rads® Atlas — Mammography Fifth Ed. 2013"
    },
    {
      "code": "GlobalAsymmetry",
      "display": "Global Asymmetry",
      "definition": "Global asymmetry is judged relative to the corresponding area in the contralateral breast and\r\nrepresents a large amount of fibroglandular-density tissue over a substantial portion of the\r\nbreast (at least one quadrant). There is no mass, distorted architecture or associated suspicious\r\ncalcifications. Global asymmetry usually represents a normal variant.\r\n    -- Bi-Rads® Atlas — Mammography Fifth Ed. 2013"
    },
    {
      "code": "FocalAsymmetry",
      "display": "Focal Asymmetry",
      "definition": "A focal asymmetry is judged relative to the corresponding location in the contralateral breast,\r\nand represents a relatively small amount of fibroglandular-density tissue over a confined portion\r\nof the breast (less than one quadrant). It is visible on and has similar shape on different mammographic\r\nprojections (hence a real finding rather than superimposition of normal breast structures),\r\nbut it lacks the convex-outward borders and the conspicuity of a mass. Rather, the borders\r\nof a focal asymmetry are concave-outward, and it usually is seen to be interspersed with fat.\r\nNote that occasionally what is properly described as a focal asymmetry at screening (a finding visible \r\non standard MLO and CC views) is determined at diagnostic mammography to be 2 different\r\nfindings, each visible on only 1 standard view (hence, 2 asymmetries), each of which ultimately\r\nis judged to represent superimposition of normal breast structures. Also, not infrequently, what\r\nis properly described as a focal asymmetry at screening is determined at diagnostic evaluation\r\n(mammography and/or ultrasound) to represent a mass.\r\n    -- Bi-Rads® Atlas — Mammography Fifth Ed. 2013"
    },
    {
      "code": "DevelopingAsymmetry",
      "display": "Developing Asymmetry",
      "definition": "This is a focal asymmetry that is new, larger, or more conspicuous than on a previous examination.\r\nApproximately 15% of cases of developing asymmetry are found to be malignant (either\r\ninvasive carcinoma, DCIS, or both), so these cases warrant further imaging evaluation and biopsy\r\nunless found to be characteristically benign (e.g., simple cyst at directed ultrasound). Absence\r\nof a sonographic correlate, especially for a small (< 1 cm) developing asymmetry, should not avert biopsy.\r\n    -- Bi-Rads® Atlas — Mammography Fifth Ed. 2013"
    }
  ]
}