{
  "resourceType": "CodeSystem",
  "id": "AbnormalityDuctTypeCS",
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/AbnormalityDuctTypeCS",
  "version": "0.0.2",
  "name": "AbnormalityDuctTypeCS",
  "title": "Duct Type CodeSystem",
  "status": "draft",
  "date": "2019-11-01",
  "publisher": "Hl7-Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "description": "Duct abnormality types code system.",
  "caseSensitive": true,
  "content": "complete",
  "count": 2,
  "concept": [
    {
      "code": "DuctDilatedATLASSolitaryDilatedDuct",
      "display": "Duct dilated ATLAS solitary dilated duct",
      "definition": "The mammographic finding of solitary dilated duct is rare and poorly understood. \r\nThere are anecdotal reports of solitary dilated duct as the only mammographic finding of underlying malignancy, indicating its potential importance in the early detection of breast cancer. \r\nHowever, some investigators have estimated that the finding of solitary dilated duct has a very low risk of malignancy, supporting its assessment as a benign (BI-RADS category 2) or probably benign (BI-RADS category 3) lesion. \r\nSolitary dilated duct also has been reported to coexist with more suspicious mammographic findings, but in such cases the associated mass, grouped microcalcifications, architectural distortion, or developing asymmetry would itself have a sufficiently high likelihood of malignancy to prompt a suspicious (BI-RADS category 4) assessment.Solitary dilated duct is described and illustrated in the current edition of the BI-RADS atlas as the first of four mammographic findings classified as \"special cases\" . \r\nThe accompanying text states that \"if unassociated with other suspicious clinical or mammographic findings, it is usually of minor clinical significance\". \r\nInsofar as this statement is made under the imprimatur of the widely read BI-RADS atlas, it is likely to influence those practicing radiologists without much, if any, personal experience who encounter the rare finding of solitary dilated duct. \r\nHowever, to our knowledge, to date there is no large clinical series indicating the positive predictive value for malignancy of solitary dilated duct. \r\nThe goal of this largescale study is to report the clinical and pathologic outcomes for the isolated finding of solitary dilated duct identified at screening or diagnostic mammography. \r\n-- https://www.ajronline.org/doi/full/10.2214/AJR.09.2944\r\nValid for the following modalities: MG US."
    },
    {
      "code": "DuctEctasia",
      "display": "Duct ectasia",
      "definition": "A noncancerous condition that results in clogged ducts around your nipple. \r\nWhile it sometimes causes pain, irritation and discharge, it's generally not a cause for concern. \r\nIf left untreated, it can eventually obliterate the breast duct. \r\nwww.healthline.com > health > duct-ectasia-of-the-breast\r\n\r\nValid for the following modalities: MG US."
    }
  ]
}