{
  "resourceType": "CodeSystem",
  "id": "MammoCalcificationTypeCS",
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/MammoCalcificationTypeCS",
  "version": "0.0.2",
  "name": "MammoCalcificationTypeCS",
  "title": "Mammography Calcification Type CodeSystem",
  "status": "draft",
  "date": "2019-11-01",
  "publisher": "Hl7-Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "description": "Mammography calcification type code system.",
  "caseSensitive": true,
  "content": "complete",
  "count": 13,
  "concept": [
    {
      "code": "Skin",
      "display": "Skin Calcification (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese are usually lucent-centered and pathognomonic in their appearance. Skin calcifications\r\nare most commonly seen along the inframammary fold, parasternally, overlying the axilla \r\nand around the areola. The individual calcific particles usually are tightly grouped, with individual \r\ngroups smaller than 5 mm in greatest dimension. Atypical forms may be confirmed\r\nas skin deposits by performing additional mammographic views tangential to the overlying\r\nskin. Also note that if suspicious-appearing calcifications are adjacent to a skin surface on\r\na given mammographic view, they actually may be dermal (hence benign) in nature, so that\r\ntangential-view mammography with or without magnification should be done prior to any\r\nintervention."
    },
    {
      "code": "Vascular",
      "display": "Vascular Calcification (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nParallel tracks, or linear tubular calcifications that are clearly associated with blood vessels.\r\nWhile most vascular calcification is not difficult to identify, if only a few discontinuous calcific\r\nparticles are visible in a single location and if association with a tubular structure is\r\nquestionable, then additional spot-compression magnification views may be needed to further characterize\r\ntheir nature."
    },
    {
      "code": "Coarse",
      "display": "Coarse or \"Popcorn-like\" Calcification (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese are the classic large (> 2 to 3 mm in greatest diameter) calcifications produced by an involuting fibroadenoma."
    },
    {
      "code": "LargeRodLike",
      "display": "Large Rod-Like Calcification (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese benign calcifications associated with ductal ectasia may form solid or discontinuous\r\nsmooth linear rods, most of which are 0.5 mm or larger in diameter. A small percentage of\r\nthese calcifications may have lucent centers if the calcium is in the wall of the duct (periductal),\r\nbut most are intraductal, when calcification forms within the lumen of the duct. All large\r\nrod-like calcifications follow a ductal distribution, radiating toward the nipple, occasionally\r\nbranching. The calcifications usually are bilateral, although they may be seen in only one\r\nbreast, especially when few calcific particles are visible. These calcifications usually are seen\r\nin women older than 60 years.)"
    },
    {
      "code": "Round",
      "display": "Round (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nWhen multiple, they may vary in size and therefore also in opacity. They may be considered\r\nbenign when diffuse and small (< 1 mm), and are frequently formed in the acini of lobules. When\r\nsmaller than 0.5 mm, the term \"punctate\" should be used.\r\nAn isolated group of punctate calcifications may warrant probably benign assessment and\r\nmammographic surveillance if no prior examinations are available for comparison, or\r\nimage-guided biopsy if the group is new, increasing, linear or segmental in distribution, or if\r\nadjacent to a known cancer."
    },
    {
      "code": "Rim",
      "display": "Rim  Calcification (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\n(historically, \"eggshell\", \"lucent-centered\")\r\nThese are thin benign calcifications that appear as calcium deposited on the surface of a\r\nsphere. The calcific deposits are usually less than 1 mm in thickness when viewed on edge.\r\nThese are benign nongrouped calcifications that range from smaller than 1 mm to larger\r\nthan a centimeter or more. The calcifications are round or oval, with smooth surfaces and\r\nlucent centers. Fat necrosis and calcifications in the walls of cysts are the most common \"rim\"\r\ncalcifications, although more extensive (and occasionally thicker-rimmed) calcification in the\r\nwalls of oil cysts or simple cysts may be seen."
    },
    {
      "code": "Dystrophic",
      "display": "Dystrophic Calcification (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese typically form in the irradiated breast or in the breast following trauma or surgery. The\r\ncalcifications are irregular in shape, and they are usually larger than 1 mm in size. They often\r\nhave lucent centers."
    },
    {
      "code": "MilkOfCalcium",
      "display": "Milk of Calcium Calcification (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThis is a manifestation of sedimented calcifications in macro- or microcysts, usually but not\r\nalways grouped. On the craniocaudal image they are often less evident and appear as round,\r\nsmudgy deposits, while occasionally on MLO and especially on 90° lateral (LM/ML) views,\r\nthey are more clearly defined and often semilunar, crescent shaped, curvilinear (concave up),\r\nor linear, defining the dependent portion of cysts. The most important feature of these calcifications\r\nis the apparent change in shape of the calcific particles on different mammographic\r\nprojections (craniocaudal versus occasionally the MLO view and especially LM/ML views). At\r\ntimes milk of calcium calcifications are seen adjacent to other types of calcifications that may\r\nbe associated with malignancy, so it is important to search for more suspicious forms, especially \r\nthose that do not change shape from the 90º lateral projection to the CC projection."
    },
    {
      "code": "Suture",
      "display": "Suture Calcification (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese represent calcium deposited on suture material. They are typically linear or tubular in\r\nappearance and when present, knots are frequently visible."
    },
    {
      "code": "Amorphous",
      "display": "Amorphous Calcification (Suspicious Morphology)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\n(historically, \"indistinct\")\r\nThese are sufficiently small and/or hazy in appearance that a more specific particle shape\r\ncannot be determined. Amorphous calcifications in a grouped, linear, or segmental distribution\r\nare suspicious and generally warrant biopsy. Bilateral, diffuse amorphous calcifications\r\nusually may be dismissed as benign, although baseline magnification views may be helpful.\r\nThe positive predictive value (PPV) of amorphous calcifications is reported to be\r\napproximately 20%. Therefore, calcifications of this morphology appropriately\r\nshould be placed into BI-RADS® assessment category 4B (PPV range > 10% to ? 50%)."
    },
    {
      "code": "CoarseHeterogeneous",
      "display": "Coarse Heterogeneous Calcification (Suspicious Morphology)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese are irregular, conspicuous calcifications that are generally between 0.5 mm and 1 mm\r\nand tend to coalesce, but are smaller than dystrophic calcifications. They may be associated\r\nwith malignancy but more frequently are present in a fibroadenoma or in areas of fibrosis or\r\ntrauma representing evolving dystrophic calcifications. Numerous bilateral groups of coarse\r\nheterogeneous calcifications usually may be dismissed as benign, although baseline magnification\r\nviews may be helpful. However, a single group of coarse heterogeneous calcifications has a positive\r\npredictive value of slightly less than 15%, and therefore this finding should be\r\nplaced in BI-RADS® assessment category 4B (PPV range > 10% to ? 50%)."
    },
    {
      "code": "Fine Pleomorphic",
      "display": "Fine Pleomorphic Calcification (Suspicious Morphology)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese calcifications are usually more conspicuous than amorphous forms and are seen to have\r\ndiscrete shapes. These irregular calcifications are distinguished from fine linear and fine-linear\r\nbranching forms by the absence of fine-linear particles. Fine pleomorphic calcifications vary in\r\nsize and shape and are usually smaller than 0.5 mm in diameter. They have a somewhat higher\r\nPPV for malignancy (29%) than amorphous or coarse heterogeneous calcifications,\r\nbut also should be placed in BI-RADS® assessment category 4B (PPV range > 10% to ? 50%)."
    },
    {
      "code": "FineLinear",
      "display": "Fine Linear or Fine-Linear Branching Calcification (Suspicious Morphology)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese are thin, linear, irregular calcifications, which may be discontinuous and which are\r\nsmaller than 0.5 mm in caliber. Occasionally, branching forms may be seen. Their\r\nappearance suggests filling of the lumen of a duct or ducts involved irregularly by\r\nbreast cancer. Among the suspicious calcifications, fine linear and fine-linear\r\nbranching calcifications have the highest PPV (70%). Therefore, these calcifications\r\nshould be placed in BI-RADS® assessment category 4C (PPV range > 50% to < 95%)."
    }
  ]
}