{
  "resourceType": "CodeSystem",
  "id": "CalcificationDistributionCS",
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/CalcificationDistributionCS",
  "version": "0.0.2",
  "name": "CalcificationDistributionCS",
  "title": "Calcification Distribution CodeSystem",
  "status": "draft",
  "date": "2019-11-01",
  "publisher": "Hl7-Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "description": "Calcification Distribution in an abnormality code system.",
  "caseSensitive": true,
  "content": "complete",
  "count": 7,
  "concept": [
    {
      "code": "ClusteredDistribution",
      "display": "Clustered distribution",
      "definition": "[PR] Clustered distribution\r\nClustered Distribution is in regards to a type of calcification with at least 5 calcifications occupying a small volume of tissue.\r\nValid for the following modalities: MG."
    },
    {
      "code": "DiffuseDistribution",
      "display": "Diffuse distribution",
      "definition": "[PR] Diffuse distribution\r\nC1268689\r\n[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nDiffuse (historically, \"scattered\"). These are calcifications that are distributed randomly throughout the breast. Punctate and amorphous calcifications in this distribution are almost always benign, especially if bilateral.\r\nValid for the following modalities: MG."
    },
    {
      "code": "GroupedDistribution",
      "display": "Grouped distribution",
      "definition": "[PR] Grouped distribution\r\nC1268691\r\n[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThis term should be used when relatively few calcifications occupy a small portion of breast tissue. The lower limit for use of this descriptor is usually when 5 calcifications are grouped within 1 cm of each other or when a definable pattern is identified. The upper limit for use of this descriptor is when larger numbers of calcifications are grouped within 2 cm of each other.)\r\nValid for the following modalities: MG."
    },
    {
      "code": "LinearDistribution",
      "display": "Linear distribution",
      "definition": "[PR] Linear distribution\r\nC1268690\r\n[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese are calcifications arrayed in a line. This distribution may elevate suspicion for malignancy, as it suggests deposits in a duct. Note that both vascular and large rod-like calcifications also are usually linear in distribution, but that these typically benign calcifications have a characteristically benign morphology.)\r\nValid for the following modalities: MG."
    },
    {
      "code": "RegionalDistribution",
      "display": "Regional distribution",
      "definition": "[PR] Regional distribution\r\nC1268692\r\n[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThis descriptor is used for numerous calcifications that occupy a large portion of breast tissue (more than 2 cm in greatest dimension), not conforming to a duct distribution. Since this distribution may involve most of a quadrant or even more than a single quadrant, malignancy is less likely. However, overall evaluation of regional calcifications must include particle shape (morphology) as well as distribution.\r\nValid for the following modalities: MG."
    },
    {
      "code": "ScatteredDistribution",
      "display": "Scattered distribution",
      "definition": "[PR] Scattered distribution\r\nRefers to a type of calcification of the breast. Scattered calcifications or multiple similar appearing clusters of calcifications throughout the whole breast.\r\n\r\nValid for the following modalities: MG."
    },
    {
      "code": "SegmentalDistribution",
      "display": "Segmental distribution",
      "definition": "[PR] Segmental distribution\r\nC1268693\r\n[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nCalcifications in a segmental distribution are of concern because they suggest deposits in a duct or ducts and their branches, raising the possibility of extensive or multifocal breast cancer in a lobe or segment of the breast. Although benign causes of segmental calcifications exist (e.g. large rod-like), the smooth, rod-like morphology and large size of benign calcifications distinguish them from finer, more pleomorphic or heterogeneous malignant calcifications. A segmental distribution may elevate the degree of suspicion for calcifications such as punctate or amorphous forms.\r\nValid for the following modalities: MG."
    }
  ]
}