{
  "resourceType": "CodeSystem",
  "id": "CalcificationDistributionCS",
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/CalcificationDistributionCS",
  "version": "0.0.2",
  "name": "CalcificationDistributionCS",
  "title": "Calcification Distribution CodeSystem",
  "status": "draft",
  "date": "2019-11-01",
  "publisher": "Hl7-Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "description": "Calcification Distribution in an abnormality code system.",
  "caseSensitive": true,
  "content": "complete",
  "count": 7,
  "concept": [
    {
      "code": "ClusteredDistribution",
      "display": "Clustered distribution",
      "definition": "Grouped (historically, \"clustered\") This term should be used when relatively few calcifications occupy a small portion of breasttissue. \r\nThe lower limit for use of this descriptor is usually when 5 calcifications are groupedwithin 1 cm of each other or when a definable pattern is identified. \r\nThe upper limit for useof this descriptor is when larger numbers of calcifications are grouped within 2 cm of eachother. \r\n-- Breast Imaging Reporting and Data System—Ultrasound, Second Edition#73\r\n\r\nValid for the following modalities: MG."
    },
    {
      "code": "DiffuseDistribution",
      "display": "Diffuse distribution",
      "definition": "Diffuse (historically, \"scattered\"). \r\nThese are calcifications that are distributed randomly throughout the breast. \r\n Punctate and amorphous calcifications in this distribution are almost always benign, especially if bilateral.\r\n[-- Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nValid for the following modalities: MG."
    },
    {
      "code": "GroupedDistribution",
      "display": "Grouped distribution",
      "definition": "This term should be used when relatively few calcifications occupy a small portion of breast tissue. \r\nThe lower limit for use of this descriptor is usually when 5 calcifications are grouped within 1 cm of each other or when a definable pattern is identified. \r\nThe upper limit for use of this descriptor is when larger numbers of calcifications are grouped within 2 cm of each other.)\r\n[-- Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nValid for the following modalities: MG."
    },
    {
      "code": "LinearDistribution",
      "display": "Linear distribution",
      "definition": "These are calcifications arrayed in a line. \r\nThis distribution may elevate suspicion for malignancy, as it suggests deposits in a duct. \r\nNote that both vascular and large rod-like calcifications also are usually linear in distribution, but that these typically benign calcifications have a characteristically benign morphology.)\r\n[-- Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nValid for the following modalities: MG."
    },
    {
      "code": "RegionalDistribution",
      "display": "Regional distribution",
      "definition": "This descriptor is used for numerous calcifications that occupy a large portion of breast tissue (more than 2 cm in greatest dimension), not conforming to a duct distribution. \r\nSince this distribution may involve most of a quadrant or even more than a single quadrant, malignancy is less likely. \r\nHowever, overall evaluation of regional calcifications must include particle shape (morphology) as well as distribution.\r\n[-- Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nValid for the following modalities: MG."
    },
    {
      "code": "ScatteredDistribution",
      "display": "Scattered distribution",
      "definition": "Scattered distributions are also called diffuse distributions. \r\nThese are calcifications that are distributed randomly throughout the breast. \r\nPunctate andamorphous calcifications in this distribution are almost always benign, especially if bilateral (in both breasts). \r\n-- Breast Imaging Reporting and Data System—Ultrasound, Second Edition#70\r\n\r\nValid for the following modalities: MG."
    },
    {
      "code": "SegmentalDistribution",
      "display": "Segmental distribution",
      "definition": "Calcifications in a segmental distribution are of concern because they suggest deposits in a duct or ducts and their branches, raising the possibility of extensive or multifocal breast cancer in a lobe or segment of the breast. \r\nAlthough benign causes of segmental calcifications exist (e.g. \r\nlarge rod-like), the smooth, rod-like morphology and large size of benign calcifications distinguish them from finer, more pleomorphic or heterogeneous malignant calcifications. \r\nA segmental distribution may elevate the degree of suspicion for calcifications such as punctate or amorphous forms.\r\n[-- Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nValid for the following modalities: MG."
    }
  ]
}