{
  "resourceType": "CodeSystem",
  "id": "AbnormalityLymphNodeTypeCS",
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/AbnormalityLymphNodeTypeCS",
  "version": "0.0.2",
  "name": "AbnormalityLymphNodeTypeCS",
  "title": "Lymph Node Type CodeSystem",
  "status": "draft",
  "date": "2019-11-01",
  "publisher": "Hl7-Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "description": "Lymph node abnormality types code system.",
  "caseSensitive": true,
  "content": "complete",
  "count": 9,
  "concept": [
    {
      "code": "NodeAxillary",
      "display": "Node axillary",
      "definition": "Axillary Nodes. \r\nThe axillary nodes are a group of lymph nodes located in the axillary (or armpit) region of the body. \r\nThey perform the vital function of filtration and conduction of lymph from the upper limbs, pectoral region, and upper back.There are five axillary lymph node groups, namely the lateral (humeral), anterior (pectoral), posterior (subscapular), central and apical nodes.\r\n\r\nValid for the following modalities: MG US."
    },
    {
      "code": "NodeEnlarged",
      "display": "Node enlarged",
      "definition": "Swollen lymph nodes usually occur as a result of infection from bacteria or viruses. \r\nRarely, swollen lymph nodes are caused by cancer.Your lymph nodes, also called lymph glands, play a vital role in your body's ability to fight off infections. \r\nThey function as filters, trapping viruses, bacteria and other causes of illnesses before they can infect other parts of your body. \r\nCommon areas where you might notice swollen lymph nodes include your neck, under your chin, in your armpits and in your groin.\r\n\r\nValid for the following modalities: MG US."
    },
    {
      "code": "NodeFocalCortex",
      "display": "Node focal cortex",
      "definition": "The mammogram and/or ultrasound show enlargement of the cortex. \r\nMetastatic deposits accumulate in the lymph node peripheral area, causing enlargement of the cortex, usually focal (at early stages), or uniform. \r\n-- www.ncbi.nlm.nih.gov > pmc > articles > PMC4337126\r\nValid for the following modalities: MG US."
    },
    {
      "code": "NodeInfraclavicular",
      "display": "Node infraclavicular",
      "definition": "(Infraclavicular labeled at upper left.) One or two deltopectoral lymph nodes (or infraclavicular nodes) are found beside the cephalic vein, between the pectoralis major and deltoideus, immediately below the clavicle . \r\nThey are situated in the course of the external collecting trunks of the arm.\r\n\r\nValid for the following modalities: US."
    },
    {
      "code": "NodeIntramammary",
      "display": "Node intramammary",
      "definition": "Intramammary lymph nodes are defined as lymph nodes surrounded by breast tissue.\r\n\r\nValid for the following modalities: MG US."
    },
    {
      "code": "NodeLymph",
      "display": "Node lymph",
      "definition": "Abnormal lymph node viewed on ultrasound and/or ultrasound. \r\nEnlarged lymph nodes may warrant comment, clinical correlation and additional evaluation, especially if new or considerably larger or rounder when compared to previous examination. \r\n-- Breast Imaging Reporting and Data System—Ultrasound, Second Edition\r\n\r\nValid for the following modalities: MG US."
    },
    {
      "code": "NodeLymphNormal",
      "display": "Node lymph normal",
      "definition": "The normal lymph node findings are probably benign.\r\n\r\nValid for the following modalities: MG US."
    },
    {
      "code": "NodeSupraclavicular",
      "display": "Node supraclavicular",
      "definition": "The supraclavicular lymph nodes are a set of lymph nodes found just above the clavicle or collarbone, toward the hollow of the neck. \r\nLymph nodes are responsible for filtering the lymphatic fluid of unwanted debris and bacteria.\r\n\r\nValid for the following modalities: US."
    },
    {
      "code": "NodeUniformThickness",
      "display": "Node uniform thickness",
      "definition": "The mammogram and/or ultrasound shows thickening of the cortex is an indicator of an early change in metastasis. \r\n The qualitative methods used for the diagnosis of lymph node metastases on US include a round morphology, hypoechogenicity, loss of central hilum, or eccentric cortical hypertrophy.\r\n\r\nValid for the following modalities: MG US."
    }
  ]
}