{
  "resourceType": "CodeSystem",
  "id": "BreastRadMammoBreastDensityCS",
  "extension": [
    {
      "url": "http://www.fragment.com/fragment",
      "valueUrl": "http://hl7.org/fhir/us/breast-radiology/StructureDefinition/HeaderFragment"
    },
    {
      "url": "http://www.fragment.com/mapname",
      "valueString": "Common"
    }
  ],
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/BreastRadMammoBreastDensityCS",
  "version": "0.0.2",
  "name": "BreastRadMammoBreastDensityCS",
  "title": "Mammo Breast Density CodeSystem",
  "status": "draft",
  "date": "2019-11-01",
  "publisher": "Hl7-Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "description": "Codes for mammography breast density values.",
  "caseSensitive": true,
  "content": "complete",
  "count": 4,
  "concept": [
    {
      "code": "Fatty",
      "display": "The breasts are almost entirely fatty",
      "definition": "Unless an area containing cancer is not included in the image field of the mammogram,\r\nmammography is highly sensitive in this setting.\r\n    -- Bi-Rads® Atlas — Mammography Fifth Ed. 2013"
    },
    {
      "code": "Fibroglandular",
      "display": "Scattered areas of fibroglandular density",
      "definition": "(historically, there are scattered fibroglandular densities).\r\n\r\nIt may be helpful to distinguish breasts in which there are a few scattered areas of\r\nfibroglandular-density tissue from those in which there are moderate scattered areas of\r\nfibroglandular-density tissue. Note that there has been a subtle change in the wording\r\nof this category, to conform to BI-RADS® lexicon use of the term \"density\" to describe\r\nthe degree of x-ray attenuation of breast tissue but not to represent discrete\r\nmammographic findings.\r\n    -- Bi-Rads® Atlas — Mammography Fifth Ed. 2013"
    },
    {
      "code": "HeterogeneouslyDense",
      "display": "The breasts are heterogeneously dense, which may obscure detection of small masses",
      "definition": "It is not uncommon for some areas in such breasts to be relatively dense while other\r\nareas are primarily fatty. When this occurs, it may be helpful to describe the location(s)\r\nof the denser tissue in a second sentence, so that the referring clinician is aware that\r\nthese are the areas in which small noncalcified lesions may be obscured. Suggested\r\nwordings for the second sentence include:\r\n\r\n\"The dense tissue is located anteriorly in both breasts, and the posterior portions\r\nare mostly fatty.\"\r\n\r\n\"Primarily dense tissue is located in the upper outer quadrants of both breasts;\r\nscattered areas of fibroglandular tissue are present in the remainder of the breasts.\"\r\n    -- Bi-Rads® Atlas — Mammography Fifth Ed. 2013"
    },
    {
      "code": "ExtremelyDense",
      "display": "The breasts are extremely dense, which lowers the sensitivity of mammography.",
      "definition": "The sensitivity of mammography is lowest in this density category.\r\nThe Fourth Edition of BI-RADS®, unlike previous editions, indicated quartile ranges\r\nof percentage dense tissue (increments of 25% density) for each of the four density\r\ncategories, with the expectation that the assignment of breast density would be\r\ndistributed more evenly across categories than the historical distribution of 10% fatty,\r\n40% scattered, 40% heterogeneously and 10% extremely dense. However, it has since\r\nbeen demonstrated in clinical practice that there has been essentially no change\r\nin this historical distribution across density categories.\r\n    -- Bi-Rads® Atlas — Mammography Fifth Ed. 2013"
    }
  ]
}