{
  "resourceType": "CodeSystem",
  "id": "MammoCalcificationTypeCS",
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/MammoCalcificationTypeCS",
  "version": "0.0.2",
  "name": "MammoCalcificationTypeCS",
  "title": "Mammography Calcification Type CodeSystem",
  "status": "draft",
  "date": "2019-11-01",
  "publisher": "Hl7-Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "description": "Mammography calcification type code system.",
  "caseSensitive": true,
  "content": "complete",
  "count": 13,
  "concept": [
    {
      "code": "Skin",
      "display": "Skin Calcification (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese are usually lucent-centered and pathognomonic in their appearance. Skin calcificationsare most commonly seen along the inframammary fold, parasternally, overlying the axilla and around the areola. The individual calcific particles usually are tightly grouped, with individual groups smaller than 5 mm in greatest dimension. Atypical forms may be confirmedas skin deposits by performing additional mammographic views tangential to the overlyingskin. Also note that if suspicious-appearing calcifications are adjacent to a skin surface ona given mammographic view, they actually may be dermal (hence benign) in nature, so thattangential-view mammography with or without magnification should be done prior to anyintervention."
    },
    {
      "code": "Vascular",
      "display": "Vascular Calcification (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nParallel tracks, or linear tubular calcifications that are clearly associated with blood vessels.While most vascular calcification is not difficult to identify, if only a few discontinuous calcificparticles are visible in a single location and if association with a tubular structure isquestionable, then additional spot-compression magnification views may be needed to further characterizetheir nature."
    },
    {
      "code": "Coarse",
      "display": "Coarse or \"Popcorn-like\" Calcification (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese are the classic large (> 2 to 3 mm in greatest diameter) calcifications produced by an involuting fibroadenoma."
    },
    {
      "code": "LargeRodLike",
      "display": "Large Rod-Like Calcification (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese benign calcifications associated with ductal ectasia may form solid or discontinuoussmooth linear rods, most of which are 0.5 mm or larger in diameter. A small percentage ofthese calcifications may have lucent centers if the calcium is in the wall of the duct (periductal),but most are intraductal, when calcification forms within the lumen of the duct. All largerod-like calcifications follow a ductal distribution, radiating toward the nipple, occasionallybranching. The calcifications usually are bilateral, although they may be seen in only onebreast, especially when few calcific particles are visible. These calcifications usually are seenin women older than 60 years.)"
    },
    {
      "code": "Round",
      "display": "Round (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nWhen multiple, they may vary in size and therefore also in opacity. They may be consideredbenign when diffuse and small (< 1 mm), and are frequently formed in the acini of lobules. Whensmaller than 0.5 mm, the term \"punctate\" should be used.An isolated group of punctate calcifications may warrant probably benign assessment andmammographic surveillance if no prior examinations are available for comparison, orimage-guided biopsy if the group is new, increasing, linear or segmental in distribution, or ifadjacent to a known cancer."
    },
    {
      "code": "Rim",
      "display": "Rim  Calcification (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\n(historically, \"eggshell\", \"lucent-centered\")These are thin benign calcifications that appear as calcium deposited on the surface of asphere. The calcific deposits are usually less than 1 mm in thickness when viewed on edge.These are benign nongrouped calcifications that range from smaller than 1 mm to largerthan a centimeter or more. The calcifications are round or oval, with smooth surfaces andlucent centers. Fat necrosis and calcifications in the walls of cysts are the most common \"rim\"calcifications, although more extensive (and occasionally thicker-rimmed) calcification in thewalls of oil cysts or simple cysts may be seen."
    },
    {
      "code": "Dystrophic",
      "display": "Dystrophic Calcification (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese typically form in the irradiated breast or in the breast following trauma or surgery. Thecalcifications are irregular in shape, and they are usually larger than 1 mm in size. They oftenhave lucent centers."
    },
    {
      "code": "MilkOfCalcium",
      "display": "Milk of Calcium Calcification (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThis is a manifestation of sedimented calcifications in macro- or microcysts, usually but notalways grouped. On the craniocaudal image they are often less evident and appear as round,smudgy deposits, while occasionally on MLO and especially on 90° lateral (LM/ML) views,they are more clearly defined and often semilunar, crescent shaped, curvilinear (concave up),or linear, defining the dependent portion of cysts. The most important feature of these calcificationsis the apparent change in shape of the calcific particles on different mammographicprojections (craniocaudal versus occasionally the MLO view and especially LM/ML views). Attimes milk of calcium calcifications are seen adjacent to other types of calcifications that maybe associated with malignancy, so it is important to search for more suspicious forms, especially those that do not change shape from the 90º lateral projection to the CC projection."
    },
    {
      "code": "Suture",
      "display": "Suture Calcification (Typically Benign)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese represent calcium deposited on suture material. They are typically linear or tubular inappearance and when present, knots are frequently visible."
    },
    {
      "code": "Amorphous",
      "display": "Amorphous Calcification (Suspicious Morphology)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\n(historically, \"indistinct\")These are sufficiently small and/or hazy in appearance that a more specific particle shapecannot be determined. Amorphous calcifications in a grouped, linear, or segmental distributionare suspicious and generally warrant biopsy. Bilateral, diffuse amorphous calcificationsusually may be dismissed as benign, although baseline magnification views may be helpful.The positive predictive value (PPV) of amorphous calcifications is reported to beapproximately 20%. Therefore, calcifications of this morphology appropriatelyshould be placed into BI-RADS® assessment category 4B (PPV range > 10% to ? 50%)."
    },
    {
      "code": "CoarseHeterogeneous",
      "display": "Coarse Heterogeneous Calcification (Suspicious Morphology)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese are irregular, conspicuous calcifications that are generally between 0.5 mm and 1 mmand tend to coalesce, but are smaller than dystrophic calcifications. They may be associatedwith malignancy but more frequently are present in a fibroadenoma or in areas of fibrosis ortrauma representing evolving dystrophic calcifications. Numerous bilateral groups of coarseheterogeneous calcifications usually may be dismissed as benign, although baseline magnificationviews may be helpful. However, a single group of coarse heterogeneous calcifications has a positivepredictive value of slightly less than 15%, and therefore this finding should beplaced in BI-RADS® assessment category 4B (PPV range > 10% to ? 50%)."
    },
    {
      "code": "Fine Pleomorphic",
      "display": "Fine Pleomorphic Calcification (Suspicious Morphology)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese calcifications are usually more conspicuous than amorphous forms and are seen to havediscrete shapes. These irregular calcifications are distinguished from fine linear and fine-linearbranching forms by the absence of fine-linear particles. Fine pleomorphic calcifications vary insize and shape and are usually smaller than 0.5 mm in diameter. They have a somewhat higherPPV for malignancy (29%) than amorphous or coarse heterogeneous calcifications,but also should be placed in BI-RADS® assessment category 4B (PPV range > 10% to ? 50%)."
    },
    {
      "code": "FineLinear",
      "display": "Fine Linear or Fine-Linear Branching Calcification (Suspicious Morphology)",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese are thin, linear, irregular calcifications, which may be discontinuous and which aresmaller than 0.5 mm in caliber. Occasionally, branching forms may be seen. Theirappearance suggests filling of the lumen of a duct or ducts involved irregularly bybreast cancer. Among the suspicious calcifications, fine linear and fine-linearbranching calcifications have the highest PPV (70%). Therefore, these calcificationsshould be placed in BI-RADS® assessment category 4C (PPV range > 50% to < 95%)."
    }
  ]
}