{
  "resourceType": "CodeSystem",
  "id": "MGAbnormalityAsymmetryTypeCS",
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/MGAbnormalityAsymmetryTypeCS",
  "version": "0.0.2",
  "name": "MGAbnormalityAsymmetryTypeCS",
  "title": "Mammography Asymmetry Type CodeSystem",
  "status": "draft",
  "date": "2019-11-01",
  "publisher": "Hl7-Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "description": "Mammography asymmetry abnormality type code system.",
  "caseSensitive": true,
  "content": "complete",
  "count": 4,
  "concept": [
    {
      "code": "Asymmetry",
      "display": "Asymmetry",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThis is an area of fibroglandular-density tissue that is visible on only one mammographic projection.Most such findings represent summation artifact, a superimposition of normal breast structures,whereas those confirmed to be real lesions (by subsequent demonstration on at least onemore projection) may represent one of the other types of asymmetry or a mass."
    },
    {
      "code": "GlobalAsymmetry",
      "display": "Global Asymmetry",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nGlobal asymmetry is judged relative to the corresponding area in the contralateral breast andrepresents a large amount of fibroglandular-density tissue over a substantial portion of thebreast (at least one quadrant). There is no mass, distorted architecture or associated suspiciouscalcifications. Global asymmetry usually represents a normal variant."
    },
    {
      "code": "FocalAsymmetry",
      "display": "Focal Asymmetry",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nA focal asymmetry is judged relative to the corresponding location in the contralateral breast,and represents a relatively small amount of fibroglandular-density tissue over a confined portionof the breast (less than one quadrant). It is visible on and has similar shape on different mammographicprojections (hence a real finding rather than superimposition of normal breast structures),but it lacks the convex-outward borders and the conspicuity of a mass. Rather, the bordersof a focal asymmetry are concave-outward, and it usually is seen to be interspersed with fat.Note that occasionally what is properly described as a focal asymmetry at screening (a finding visible on standard MLO and CC views) is determined at diagnostic mammography to be 2 differentfindings, each visible on only 1 standard view (hence, 2 asymmetries), each of which ultimatelyis judged to represent superimposition of normal breast structures. Also, not infrequently, whatis properly described as a focal asymmetry at screening is determined at diagnostic evaluation(mammography and/or ultrasound) to represent a mass."
    },
    {
      "code": "DevelopingAsymmetry",
      "display": "Developing Asymmetry",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThis is a focal asymmetry that is new, larger, or more conspicuous than on a previous examination.Approximately 15% of cases of developing asymmetry are found to be malignant (eitherinvasive carcinoma, DCIS, or both), so these cases warrant further imaging evaluation and biopsyunless found to be characteristically benign (e.g., simple cyst at directed ultrasound). Absenceof a sonographic correlate, especially for a small (< 1 cm) developing asymmetry, should not avert biopsy."
    }
  ]
}