{
  "resourceType": "CodeSystem",
  "id": "BreastRadUSPosteriorAcousticFeaturesCS",
  "extension": [
    {
      "url": "http://www.fragment.com/fragment",
      "valueUrl": "http://hl7.org/fhir/us/breast-radiology/StructureDefinition/HeaderFragment"
    },
    {
      "url": "http://www.fragment.com/mapname",
      "valueString": "Common"
    }
  ],
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/BreastRadUSPosteriorAcousticFeaturesCS",
  "version": "0.0.2",
  "name": "BreastRadUSPosteriorAcousticFeaturesCS",
  "title": "US Posterior Acoustic Features CodeSystem",
  "status": "draft",
  "date": "2019-11-01",
  "publisher": "Hl7-Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "description": "Ultra-sound mass Posterior acoustic features codes.",
  "caseSensitive": true,
  "content": "complete",
  "count": 4,
  "concept": [
    {
      "code": "NoPosteriorAcousticFeatures",
      "display": "No Posterior Acoustic Features",
      "definition": "No shadowing or enhancement is present deep to the mass; the echogenicity of the area\r\nimmediately behind the mass is not different from that of adjacent tissue at the same depth.\r\n    -- Bi-Rads® Atlas — Mammography Fifth Ed. 2013"
    },
    {
      "code": "Enhancement",
      "display": "Enhancement",
      "definition": "Sound transmission is unimpeded in its passage through the mass. Enhancement appears as\r\na column that is more echogenic (whiter) deep to the mass. One criterion for cyst diagnosis\r\nis enhancement. Homogeneous solid lesions, including high-grade carcinomas, may also show enhancement.\r\n    -- Bi-Rads® Atlas — Mammography Fifth Ed. 2013"
    },
    {
      "code": "Shadowing",
      "display": "Shadowing",
      "definition": "Shadowing is attenuation of the acoustic transmission. Sonographically, the area posterior to\r\nthe mass appears darker. At the edges of curved masses, acoustic velocity changes and thin\r\nshadows are seen. This refractive edge shadowing is of no significance and should be distinguished\r\nfrom central shadowing, which is a property of the mass.\r\n\r\nShadowing is associated with fibrosis, with or without an underlying carcinoma. Postsurgical\r\nscars, fibrous mastopathy and many cancers with or without a desmoplastic response will show\r\nposterior acoustic shadowing. Macrocalcifications can also attenuate sound. Similar to a vertical\r\n(taller-than-wide) orientation, shadowing is a feature more helpful when present than when\r\nabsent. Many cancers will exhibit enhancement or no change in posterior features, particularly\r\nthose that are high grade.\r\n    -- Bi-Rads® Atlas — Mammography Fifth Ed. 2013"
    },
    {
      "code": "CombinedPattern",
      "display": "Combined Pattern",
      "definition": "Some lesions have more than one pattern of posterior attenuation. For example, a fibroadenoma\r\ncontaining a large calcification may demonstrate shadowing posterior to the calcified\r\narea but enhancement of the tissues deep to the uncalcified portion. A combined pattern\r\nof posterior features also may be seen in lesions that are evolving. One such example is a\r\npost-lumpectomy seroma, which enhances posteriorly. As the fluid is resorbed and scarring\r\ndevelops, the features of fibrosis become evident as spiculation of the margins and posterior\r\nacoustic shadowing.\r\n    -- Bi-Rads® Atlas — Mammography Fifth Ed. 2013"
    }
  ]
}