{
  "resourceType": "CodeSystem",
  "id": "GraphicTypeCS",
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/GraphicTypeCS",
  "version": "0.0.2",
  "name": "GraphicTypeCS",
  "title": "GraphicType CodeSystem",
  "status": "draft",
  "date": "2019-11-01",
  "publisher": "Hl7-Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "description": "GraphicType code system.",
  "caseSensitive": true,
  "content": "complete",
  "count": 5,
  "concept": [
    {
      "code": "POINT",
      "display": "POINT",
      "definition": "If Graphic Type is POINT, then two values (one point) shall be specified and the single point specified is to be drawn."
    },
    {
      "code": "POLYLINE",
      "display": "POLYLINE",
      "definition": "If Graphic Type is POLYLINE, then the points are to be interpreted as an n-tuple list of end points between which straight lines are to be drawn."
    },
    {
      "code": "INTERPOLATED",
      "display": "INTERPOLATED",
      "definition": "If Graphic Type is INTERPOLATED, then the points are to be interpreted as an n-tuple list of end points between which some form of implementation dependent curved lines are to be drawn. The rendered line shall pass through all the specified points."
    },
    {
      "code": "CIRCLE",
      "display": "CIRCLE",
      "definition": "If Graphic Type is CIRCLE, then exactly two points shall be present; the first point is to be interpreted as the center and the second point as a point on the circumference of a circle, some form of implementation dependent representation of which is to be drawn."
    },
    {
      "code": "ELLIPSE",
      "display": "ELLIPSE",
      "definition": "If Graphic Type is ELLIPSE, then exactly four points shall be present; the first two points are to be interpreted as the endpoints of the major axis and the second two points as the endpoints of the minor axis of an ellipse, some form of implementation dependent representation of which is to be drawn."
    }
  ]
}