{
  "resourceType": "CodeSystem",
  "id": "ObservedFeatureCS",
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/ObservedFeatureCS",
  "version": "0.0.2",
  "name": "ObservedFeatureCS",
  "title": "Observed Feature CodeSystem",
  "status": "draft",
  "date": "2019-11-01",
  "publisher": "Hl7-Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "description": "Observed Feature seen during a breast examination.",
  "caseSensitive": true,
  "content": "complete",
  "count": 26,
  "concept": [
    {
      "code": "ArchitecturalDistortion",
      "display": "Architectural distortion",
      "definition": "[PR] Architectural distortion\r\nArchitectural distortion is often due to a desmoplastic reaction in which there is focal disruption of the normal breast tissue pattern. Architectural distortion is among the most common presentations for breast cancer. An architectural distortion may be caused by sclerosing adenosis, or a thing called radial scar, both of which are benign and both quite rare. Architectural distortion uncommonly indicates cancer.\r\nValid for the following modalities: MG US MRI."
    },
    {
      "code": "AxillaryAdenopathy",
      "display": "Axillary adenopathy",
      "definition": "[PR] Axillary adenopathy\r\nAxillary lymphadenopathy is a condition in which the lymph nodes of the axillary region — commonly known as the armpit — are enlarged. The condition can be diagnosed on the basis of a physical exam or imaging studies.\r\n[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nEnlarged axillary lymph nodes may warrant comment, clinical correlation, and additional evaluation, especially if new or considerably larger or rounder when compared to previous examination.A review of the patient's medical history may elucidate the cause for axillary adenopathy, avertingrecommendation for additional evaluation. When one or more large axillary nodes are substantially composed of fat, this is a normal variant.\r\nValid for the following modalities: MG MRI."
    },
    {
      "code": "BiopsyClip",
      "display": "Biopsy clip",
      "definition": "[PR] Biopsy clip\r\nThe biopsy clip serves as a marker documenting where the tissue was sampled in the breast. If the original abnormality is no longer visible by imaging after the biopsy, the marker is the only guide we have to know where the diseased tissue was sampled.\r\nValid for the following modalities: MG US MRI."
    },
    {
      "code": "BiopsyClips",
      "display": "Biopsy clips",
      "definition": "[PR] Biopsy clips\r\nTissue marker placement after image-guided breast biopsy has become a routine component of clinical practice. Marker placement distinguishes multiple biopsied lesions within the same breast, prevents re-biopsy of benign lesions, enables multi-modality correlation, guides pre-operative localization and helps confirm surgical target removal. Numerous breast tissue markers are currently available, with varied shapes, composition, and associated bio-absorbable components. This review serves to familiarize the breast interventionalist with the tissue markers most widely available in the United States today and to provide guidance regarding selection of appropriate markers for various clinical settings.\r\nValid for the following modalities: MG US MRI."
    },
    {
      "code": "BrachytherapyTube",
      "display": "Brachytherapy tube",
      "definition": "[PR] Brachytherapy tube\r\nBrachytherapy (brak-e-THER-uh-pee) is a procedure that involves placing radioactive material inside your body.\r\n\r\nBrachytherapy is one type of radiation therapy that's used to treat cancer. Brachytherapy is sometimes called internal radiation.\r\n\r\nBrachytherapy allows doctors to deliver higher doses of radiation to more-specific areas of the body, compared with the conventional form of radiation therapy (external beam radiation) that projects radiation from a machine outside of your body.\r\nValid for the following modalities: MG."
    },
    {
      "code": "ChestWallInvasion",
      "display": "Chest wall invasion",
      "definition": "[PR] Chest wall invasion\r\nA tumor of the lung that has invaded the chest wall. \r\nValid for the following modalities: MG US MRI."
    },
    {
      "code": "CooperDistorted",
      "display": "Cooper distorted",
      "definition": "[PR] Cooper distorted\r\nC1268682\r\nValid for the following modalities: US."
    },
    {
      "code": "CooperThickened",
      "display": "Cooper thickened",
      "definition": "[PR] Cooper thickened\r\nThe cooper's ligaments are fibrous bands extending vertically from surface attach on chest wall muscles. These ligaments maintain the shape and structure of your breasts and help to prevent sagging. Cooper’s ligaments support the breasts on the chest wall, maintain their contour, and keep them in position.These support breast tissue; they become contracted in cancer of breast, producing dimples in overlying skin. \r\nThickening occurs when there are skin changes usually associated with the presence of a mass, benign or malignant, that causes shortening in the Coopers ligenments due to fibrosis. \r\nValid for the following modalities: US."
    },
    {
      "code": "Edema",
      "display": "Edema",
      "definition": "[PR] Edema\r\nEdema may be due to blockage of subdermal lymphatics by tumor cells or an inflammatory process within the breast or axilla.\r\n[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nLucent Centered: Lucent-centered calcifications, as depicted below, which are round or oval, are almost always benign, and they have thicker walls than those of rim or eggshell calcifications. Skin calcifications are often lucent-centered, and lucent-centered calcifications may form around benign debris in the ducts.\r\nValid for the following modalities: US."
    },
    {
      "code": "EdemaAdj",
      "display": "Edema adj",
      "definition": "[PR] Edema adj\r\n\r\nValid for the following modalities: US."
    },
    {
      "code": "GoldSeed",
      "display": "Gold Seed",
      "definition": "[PR] Gold Seed\r\n\r\nValid for the following modalities: MG."
    },
    {
      "code": "Hematoma",
      "display": "Hematoma",
      "definition": "[PR] Hematoma\r\nA hematoma (US spelling)  is a localized bleeding outside of blood vessels, due to either disease or trauma including injury or surgery and may involve blood continuing to seep from broken capillaries.\r\nValid for the following modalities: MG."
    },
    {
      "code": "NippleRetraction",
      "display": "Nipple retraction",
      "definition": "[PR] Nipple retraction\r\nRetracted nipples lie flat against the areola. The condition can be the result of inflammation or scarring of the tissue behind the nipple, and caused by numerous conditions, not just cancer. ... In the case of breast cancer, nipple retraction occurs when the tumor attacks the duct behind the nipple, pulling it in.\r\n[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThe nipple is pulled in. This should not be confused with nipple inversion, which is often bilateral and which in the absence of any suspicious findings and when stable for a long period of time, is not a sign of malignancy. However, if nipple retraction is new, suspicion for underlying malignancy is increased.\r\nValid for the following modalities: MG MRI."
    },
    {
      "code": "NOChestWallInvasion",
      "display": "NO Chest wall invasion",
      "definition": "[PR] NO Chest wall invasion\r\n\r\nValid for the following modalities: MRI."
    },
    {
      "code": "PectoralisMuscleInvasion",
      "display": "Pectoralis muscle invasion",
      "definition": "[PR] Pectoralis muscle invasion\r\nPectoralis muscle invasion is when a tumor has become large enough to invade into the pectoralis muscle.  \r\nValid for the following modalities: US MRI."
    },
    {
      "code": "PectoralisMuscleInvolvement",
      "display": "Pectoralis muscle involvement",
      "definition": "[PR] Pectoralis muscle involvement\r\n\r\nValid for the following modalities: MRI."
    },
    {
      "code": "PectoralisMuscleTenting",
      "display": "Pectoralis muscle tenting",
      "definition": "[PR] Pectoralis muscle tenting\r\n\r\nValid for the following modalities: US MRI."
    },
    {
      "code": "PostSurgicalScar",
      "display": "Post surgical scar",
      "definition": "[PR] Post surgical scar\r\nPost surgical scarring happens because of the incisions needed to surgically remove tumor, cells, etc. The amount of scarring is connected to the different stages of wound healing. Surgical scar care should be continued for a year. \r\nValid for the following modalities: MG."
    },
    {
      "code": "Seroma",
      "display": "Seroma",
      "definition": "[PR] Seroma\r\nA breast seroma is a collection (pocket) of serous fluid that can develop after trauma to the breast or following procedures such as breast surgery or radiation therapy. Serous fluid is a pale yellow, transparent fluid that contains protein, but no blood cells or pus.\r\nValid for the following modalities: MG."
    },
    {
      "code": "SkinInvolvement",
      "display": "Skin involvement",
      "definition": "[PR] Skin involvement\r\n\r\nValid for the following modalities: MG US MRI."
    },
    {
      "code": "SkinLesion",
      "display": "Skin lesion",
      "definition": "[PR] Skin lesion\r\nA skin lesion is a part of the skin that has an abnormal growth or appearance compared to the skin around it.In order to diagnose a skin lesion, a dermatologist or doctor will conduct a full physical exam. \r\n[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThis finding may be described in the mammography report or annotated on the mammographicimage when it projects over the breast (especially on 2 different projections), and may be mistakenfor an intramammary lesion. A raised skin lesion sufficiently large to be seen at mammographyshould be marked by the technologist with a radiopaque device designated for use as a marker fora skin lesion.\r\nValid for the following modalities: MG."
    },
    {
      "code": "SkinRetraction",
      "display": "Skin retraction",
      "definition": "[PR] Skin retraction\r\nSkin retraction (or inversion) or Skin retraction. Breast cancers that are located near the skin or nipple may cause scarring within the breast that pulls at the nipple or nearby skin. Skin and nipple retraction are more obvious when a woman raises her arms above her head or leans forward.\r\nValid for the following modalities: MG US MRI."
    },
    {
      "code": "SkinThickening",
      "display": "Skin thickening",
      "definition": "[PR] Skin thickening\r\n\r\n[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nSkin thickening may be focal or diffuse, and is defined as being greater than 2 mm in thickness. This finding is of particular concern if it represents a change from previous mammography examinations. However, unilateral skin thickening is an expected finding after radiation therapy.\r\nValid for the following modalities: MG US MRI."
    },
    {
      "code": "SurgicalClip",
      "display": "Surgical clip",
      "definition": "[PR] Surgical clip\r\nMost surgical clips are currently made of titanium, and as many as 30 to 40 clips may be used during a single surgical procedure. They remain inside the patient's body after the wounds are healed.\r\nValid for the following modalities: MG."
    },
    {
      "code": "SurgicalClips",
      "display": "Surgical clips",
      "definition": "[PR] Surgical clips\r\nA series of surgical staples or clips are used during surgery. In one push of a button the blood supply is cut off to the anatomical part being removed and a staple line is left in the patient and on the side where the pathology has been removed.\r\nValid for the following modalities: MG."
    },
    {
      "code": "TrabecularThickening",
      "display": "Trabecular thickening",
      "definition": "[PR] Trabecular thickening\r\nDiffusely increased density, skin edema, and trabecular thickening are mammographic manifestations of the edema and lymphatic obstruction in inflammatory carcinoma of the breast. \r\n[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThis is a thickening of the fibrous septa of the breast.\r\nValid for the following modalities: MG."
    }
  ]
}