{
  "resourceType": "CodeSystem",
  "id": "MammoCalcificationDistributionCS",
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/MammoCalcificationDistributionCS",
  "version": "0.0.2",
  "name": "MammoCalcificationDistributionCS",
  "title": "Mammography Calcification Distribution CodeSystem",
  "status": "draft",
  "date": "2019-11-01",
  "publisher": "Hl7-Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "description": "Mammography calcification distribution code system.",
  "caseSensitive": true,
  "content": "complete",
  "count": 5,
  "concept": [
    {
      "code": "Diffuse",
      "display": "Diffuse Calcification Distribution",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\n(historically, \"scattered\")These are calcifications that are distributed randomly throughout the breast. Punctate andamorphous calcifications in this distribution are almost always benign, especially if bilateral."
    },
    {
      "code": "Regional",
      "display": "Regional  Calcification Distribution",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThis descriptor is used for numerous calcifications that occupy a large portion of breast tissue(more than 2 cm in greatest dimension), not conforming to a duct distribution. Since thisdistribution may involve most of a quadrant or even more than a single quadrant, malignancyis less likely. However, overall evaluation of regional calcifications must include particle shape(morphology) as well as distribution."
    },
    {
      "code": "Grouped",
      "display": "Grouped  Calcification Distribution",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\n(historically, \"clustered\")This term should be used when relatively few calcifications occupy a small portion of breasttissue. The lower limit for use of this descriptor is usually when 5 calcifications are groupedwithin 1 cm of each other or when a definable pattern is identified. The upper limit for useof this descriptor is when larger numbers of calcifications are grouped within 2 cm of each other."
    },
    {
      "code": "Linear",
      "display": "Linear  Calcification Distribution",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nThese are calcifications arrayed in a line. This distribution may elevate suspicion for malignancy,as it suggests deposits in a duct. Note that both vascular and large rod-like calcificationsalso are usually linear in distribution, but that these typically benign calcifications havea characteristically benign morphology."
    },
    {
      "code": "Segmental",
      "display": "Segmental Calcification Distribution",
      "definition": "[Bi-Rads® Atlas — Mammography Fifth Ed. 2013]\r\nCalcifications in a segmental distribution are of concern because they suggest deposits in aduct or ducts and their branches, raising the possibility of extensive or multifocal breast cancerin a lobe or segment of the breast. Although benign causes of segmental calcifications exist(e.g. large rod-like), the smooth, rod-like morphology and large size of benign calcificationsdistinguish them from finer, more pleomorphic or heterogeneous malignant calcifications.A segmental distribution may elevate the degree of suspicion for calcifications such as punctate or amorphous forms."
    }
  ]
}