{
  "resourceType": "CodeSystem",
  "id": "MammoCalcificationDistributionCS",
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/MammoCalcificationDistributionCS",
  "version": "0.0.2",
  "name": "MammoCalcificationDistributionCS",
  "title": "Mammo Calcification Distribution CodeSystem",
  "status": "draft",
  "date": "2019-11-01",
  "publisher": "Hl7-Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "description": "Mammography calcification distribution codes.",
  "caseSensitive": true,
  "content": "complete",
  "count": 5,
  "concept": [
    {
      "code": "Diffuse",
      "display": "Diffuse Calcification Distribution",
      "definition": "(historically, \"scattered\")\r\nThese are calcifications that are distributed randomly throughout the breast. Punctate and\r\namorphous calcifications in this distribution are almost always benign, especially if bilateral.\r\n    -- Bi-Rads® Atlas — Mammography Fifth Ed. 2013"
    },
    {
      "code": "Regional",
      "display": "Regional  Calcification Distribution",
      "definition": "This descriptor is used for numerous calcifications that occupy a large portion of breast tissue\r\n(more than 2 cm in greatest dimension), not conforming to a duct distribution. Since this\r\ndistribution may involve most of a quadrant or even more than a single quadrant, malignancy\r\nis less likely. However, overall evaluation of regional calcifications must include particle shape\r\n(morphology) as well as distribution.\r\n    -- Bi-Rads® Atlas — Mammography Fifth Ed. 2013"
    },
    {
      "code": "Grouped",
      "display": "Grouped  Calcification Distribution",
      "definition": "(historically, \"clustered\")\r\nThis term should be used when relatively few calcifications occupy a small portion of breast\r\ntissue. The lower limit for use of this descriptor is usually when 5 calcifications are grouped\r\nwithin 1 cm of each other or when a definable pattern is identified. The upper limit for use\r\nof this descriptor is when larger numbers of calcifications are grouped within 2 cm of each other.\r\n    -- Bi-Rads® Atlas — Mammography Fifth Ed. 2013"
    },
    {
      "code": "Linear",
      "display": "Linear  Calcification Distribution",
      "definition": "These are calcifications arrayed in a line. This distribution may elevate suspicion for malignancy,\r\nas it suggests deposits in a duct. Note that both vascular and large rod-like calcifications\r\nalso are usually linear in distribution, but that these typically benign calcifications have\r\na characteristically benign morphology.\r\n    -- Bi-Rads® Atlas — Mammography Fifth Ed. 2013"
    },
    {
      "code": "Segmental",
      "display": "Segmental Calcification Distribution",
      "definition": "Calcifications in a segmental distribution are of concern because they suggest deposits in a\r\nduct or ducts and their branches, raising the possibility of extensive or multifocal breast cancer\r\nin a lobe or segment of the breast. Although benign causes of segmental calcifications exist\r\n(e.g. large rod-like), the smooth, rod-like morphology and large size of benign calcifications\r\ndistinguish them from finer, more pleomorphic or heterogeneous malignant calcifications.\r\nA segmental distribution may elevate the degree of suspicion for calcifications such as punctate or amorphous forms.\r\n    -- Bi-Rads® Atlas — Mammography Fifth Ed. 2013"
    }
  ]
}