{
  "resourceType": "ValueSet",
  "id": "breastrad-MarginVS",
  "text": {
    "status": "generated",
    "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">\n<p><b>MarginVS ValueSet</b></p>\n<p>When breast cancer is surgically removed (during a surgical biopsy, lumpectomy or mastectomy), a rim of normal tissue surrounding the tumor is also removed. This rim is called a margin. Margins help show whether or not all of the tumor was removed.\n</p>\n</div>"
  },
  "url": "http://hl7.org/fhir/us/breast-radiology/breastrad/vs/MarginVS",
  "name": "MarginVS",
  "title": "MarginVS",
  "status": "draft",
  "publisher": "Hl7 - Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "date": "2019-08-01",
  "description": "When breast cancer is surgically removed (during a surgical biopsy, lumpectomy or mastectomy), a rim of normal tissue surrounding the tumor is also removed. This rim is called a margin. Margins help show whether or not all of the tumor was removed.",
  "compose": {
    "include": [
      {
        "system": "http://hl7.org/fhir/us/breast-radiology/breastrad/cs/MarginCS",
        "concept": [
          {
            "code": "AngularMargin",
            "display": "An 'angular margin' is simply a pronounced 'angled-off' projection from the mass. Any kind of irregular or jagged projection at the margin is suspcious of malignancy."
          },
          {
            "code": "CircumscribedMargin",
            "display": "At least 75%% of the margin is sharply demarcated, with an abrupt transition between the lesion and surrounding tissue."
          },
          {
            "code": "IndistinctMargin",
            "display": "No clear demarcation of the entire margin or any portion of it from the surrounding tissue."
          },
          {
            "code": "IntraductalExtension",
            "display": "Intraductal tumor extension is a characteristic feature of primary breast carcinoma, and is an important consideration in patients undergoing breast conservative surgery. However, there have been no reports of studies of intraductal extension within the mammary ductal tree."
          },
          {
            "code": "IrregularMargin",
            "display": "Circumscribed oval and round masses are usually benign. An irregular shape suggests a greater likelihood of malignancy. The margins can be described as circumscribed, microlobulated, obscured (partially hidden by adjacent tissue), indistinct (ill-defined), or spiculated (characterized by lines radiating from the mass)."
          },
          {
            "code": "LobulatedMargin",
            "display": "The margin of the lesion reflects the demarcation of the mass with surrounding tissue. It can be smooth, micro lobulated, irregular or spiculated. Gentle bilobulate or Tri lobulated margins are considered smooth."
          },
          {
            "code": "MacrolobulatedMargin",
            "display": "No Definition found."
          },
          {
            "code": "MicrolobulatedMargin",
            "display": "A margin characterized by short-cycle undulations."
          },
          {
            "code": "NonCircumscribedMargin",
            "display": "No definition found."
          },
          {
            "code": "ObscuredMargin",
            "display": "ObscuredMargin"
          },
          {
            "code": "SmoothMargin",
            "display": "Smooth: A benign lesion usually has clear and smooth margin, which is well defined with the surrounding breast tissues. ... Similar to mammography, some early breast cancer with small foci can presents benign appearance even under high-resolution MRI."
          },
          {
            "code": "SpiculatedMargin",
            "display": "Margin is characterized by lines radiating from the mass."
          }
        ]
      }
    ]
  }
}