{
  "resourceType": "ValueSet",
  "id": "breastrad-ForeignBodyVS",
  "text": {
    "status": "generated",
    "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">\n<p><b>ForeignBodyVS ValueSet</b></p>\n<p>Foreign Body\n</p>\n</div>"
  },
  "url": "http://hl7.org/fhir/us/breast-radiology/ValueSet/breastrad-ForeignBodyVS",
  "name": "ForeignBodyVS",
  "title": "ForeignBodyVS",
  "status": "draft",
  "publisher": "Hl7 - Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "date": "2019-08-03",
  "description": "Foreign Body",
  "compose": {
    "include": [
      {
        "system": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/breastrad-ForeignBodyCS",
        "concept": [
          {
            "code": "BiopsyClip",
            "display": "A small metal clip may be inserted into the breast to mark the site of biopsy in case the tissue proves to be cancerous and additional surgery is required. ... Your doctor may recommend a surgical biopsy in follow up to, or instead of, a needle biopsy."
          },
          {
            "code": "BreastMarker",
            "display": "In breast cancer care, three tumor markers -- cancer antigen 15-3 (CA 15-3), cancer antigen 27.29 (CA 27.29), and carcinoembryonic antigen (CEA) -- have been used to help monitor metastatic breast cancer (advanced disease)."
          },
          {
            "code": "Calcification",
            "display": "Breast calcifications are small calcium deposits that develop in a woman's breast tissue. ... Microcalcifications are usually not a result of cancer."
          },
          {
            "code": "GunshotWound",
            "display": "It should be considered that isolated breast trauma, although uncommon, might occur due to gunshot trauma which generally causes to multiple organ injuries. The recognition of the abscess focus in the right breast indicates that the physical examination should always be done systemically."
          },
          {
            "code": "None",
            "display": "No foreign body present."
          },
          {
            "code": "Pacemaker",
            "display": "A pacemaker is a small device that's placed under the skin in your chest to help control your heartbeat. It's used to help your heart beat more regularly if you have an irregular heartbeat (arrhythmia), particularly a slow one. Implanting a pacemaker in your chest requires a surgical procedure."
          },
          {
            "code": "SurgicalClip",
            "display": "Guided by mammography (stereotactic-guided biopsy) or ultrasound, the surgeon or radiologist places the probe into the suspicious area of the breast. A vacuum then draws the tissue into the probe. ... In some cases, a small metal clip is placed into the biopsy site to mark the location, in case a future biopsy is needed."
          },
          {
            "code": "Wire",
            "display": "A wire guided excision biopsy means putting a wire into the breast tissue to show a surgeon which piece to remove. This procedure is used if a breast x-ray (mammogram) or ultrasound has shown an abnormal area but the doctor can't feel a lump."
          }
        ]
      }
    ]
  }
}