{
  "resourceType": "ValueSet",
  "id": "breastrad-CalcificationTypeVS",
  "text": {
    "status": "generated",
    "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">\n<p><b>CalcificationTypeVS ValueSet</b></p>\n<p>Calcification Type\n</p>\n</div>"
  },
  "url": "http://hl7.org/fhir/us/breast-radiology/ValueSet/breastrad-CalcificationTypeVS",
  "name": "CalcificationTypeVS",
  "title": "CalcificationTypeVS",
  "status": "draft",
  "publisher": "Hl7 - Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "date": "2019-08-02",
  "description": "Calcification Type",
  "compose": {
    "include": [
      {
        "system": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/breastrad-CalcificationTypeCS",
        "concept": [
          {
            "code": "Amorphous",
            "display": "Amorphous or indistinct calcifications are defined as 'without a clearly defined shape or form'. These calcifications are usually so small or hazy in appearance, that a more specific morphologic classification cannot be determined."
          },
          {
            "code": "Spherical",
            "display": "No definition found."
          },
          {
            "code": "Skin",
            "display": "Usually lucent-centered and pathognomonic in appearance."
          },
          {
            "code": "Round",
            "display": "May vary in size and, therefore, also in opacity (when < 0.5 mm, the term 'punctate' should be used)."
          },
          {
            "code": "Rim",
            "display": "Appear as calcium deposited on the surface of a sphere (usually < 1 mm in thickness when viewed on edge)."
          },
          {
            "code": "Punctate",
            "display": "Breast calcifications are small calcium deposits that develop in a woman's breast tissue. They are very common and are usually benign (noncancerous). ... Macrocalcifications are common -- they are found in approximately half of women over age 50, and one in 10 women under age 50 -- and are considered noncancerous."
          },
          {
            "code": "PleomorphicADDFine",
            "display": "Microcalcifications that vary in size and shape are of more concern — you may hear these referred to as 'pleomorphic calcifications' — and they may be clustered in a specific area of the breast. Although breast calcifications are usually noncancerous (benign), certain patterns of calcifications — such as tight clusters with irregular shapes and fine appearance — may indicate breast cancer or precancerous changes to breast tissue."
          },
          {
            "code": "None",
            "display": "No calcifications present."
          },
          {
            "code": "MilkOfCalcium",
            "display": "A manifestation of sedimented calcifications in macro- or microcysts, usually but not always grouped. Refer to lexicon classification form for complete description."
          },
          {
            "code": "LucentCentered",
            "display": "They are different from malignant-type fine branching calcifications, because they are usually > 1 mm in diameter. They may have lucent centers if the calcium is in the wall of the duct. These calcifications follow a ductal distribution, radiating toward the nipple and are usually bilateral."
          },
          {
            "code": "LinearADDFine",
            "display": "These are suspicious calcifications arranged in a line or showing a branching pattern, suggesting deposits in a duct. Although breast calcifications are usually noncancerous (benign), certain patterns of calcifications — such as tight clusters with irregular shapes and fine appearance — may indicate breast cancer or precancerous changes to breast tissue."
          },
          {
            "code": "Layering",
            "display": "Benign calcifications: These are described as layered, tea-cup shaped, or milk of calcium. These are from benign causes such as fibrocystic breast changes or ruptured breast cysts."
          },
          {
            "code": "LargeRodLike",
            "display": "Associated with ductal ectasia, may form solid or discontinuous, smooth linear rods, usually ≥ 0.5 mm in diameter."
          },
          {
            "code": "Indistinct",
            "display": "near and segmentally distributed calcifications are arranged in a line or branching pattern, indicating that the deposits are in a duct and these tend to be malignant, since most of the common malignancies are ductal."
          },
          {
            "code": "Heterogeneous",
            "display": "Coarse heterogeneous calcifications are irregular calcifications that are between 0.5 mm and 1 mm in size. They are usually in a group and are smaller in size than dystrophic calcifications. ... Coarse heterogeneous calcifications in a linear or segmental distribution are suspicious."
          },
          {
            "code": "GenericCalcification",
            "display": "Breast calcifications are small calcium deposits that develop in a woman's breast tissue. They are very common and are usually benign (noncancerous). In some instances, certain types of breast calcifications may suggest early breast cancer."
          },
          {
            "code": "Fine",
            "display": "Although breast calcifications are usually noncancerous (benign), certain patterns of calcifications — such as tight clusters with irregular shapes and fine appearance — may indicate breast cancer or precancerous changes to breast tissue."
          },
          {
            "code": "Eggshell",
            "display": "These are very thin benign calcifications that appear as calcium is deposited on the surface of a sphere."
          },
          {
            "code": "Dystrophic",
            "display": "Irregular in shape and usually > 1 mm in size; often with lucent centers"
          },
          {
            "code": "Coarse",
            "display": "These calcifications are classic, large (> 2 to 3 mm in greatest diameter), and produced by an involuting fibroadenoma."
          },
          {
            "code": "Suture",
            "display": "Typically linear or tubular in appearance; when present, knots are frequently visible."
          },
          {
            "code": "Vascular",
            "display": "Parallel tracks or linear, tubular calcifications that are clearly associated with blood vessels"
          }
        ]
      }
    ]
  }
}