{
  "resourceType": "ValueSet",
  "id": "breastrad-ConsistentWithVS",
  "text": {
    "status": "generated",
    "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">\n<p><b>ConsistentWithVS ValueSet</b></p>\n<p>Consistent With\n</p>\n</div>"
  },
  "url": "http://hl7.org/fhir/us/breast-radiology/ValueSet/breastrad-ConsistentWithVS",
  "name": "ConsistentWithVS",
  "title": "ConsistentWithVS",
  "status": "draft",
  "publisher": "Hl7 - Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "date": "2019-08-03",
  "description": "Consistent With",
  "compose": {
    "include": [
      {
        "system": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/breastrad-ConsistentWithCS",
        "concept": [
          {
            "code": "Abscess",
            "display": "A local accumulation of pus anywhere in the body."
          },
          {
            "code": "PapillaryLesion",
            "display": "Discussion. Breast papillary lesions are characterised histopathologically by the presence of fibrovascular stroma lined by epithelial and myoepithelial cells. They range from benign lesions such as ductal papillomas to the presence of invasive breast papillary carcinoma."
          },
          {
            "code": "MultiFocalCancer",
            "display": "In multifocal breast cancer, all of the tumors arise from the original tumor, and they are usually in the same section of the breast. If the cancer is multicentric, it means that all of the tumors formed separately, and they are often in different areas of the breast."
          },
          {
            "code": "MondorDisease",
            "display": "MondorDisease"
          },
          {
            "code": "MilkOfCalcium",
            "display": "A manifestation of sedimented calcifications in macro- or microcysts, usually but not always grouped. Refer to lexicon classification form for complete description."
          },
          {
            "code": "Mastitis",
            "display": "Mastitis is an inflammation of breast tissue that sometimes involves an infection. The inflammation results in breast pain, swelling, warmth and redness. You might also have fever and chills. Mastitis most commonly affects women who are breast-feeding (lactation mastitis)."
          },
          {
            "code": "MassSolidWithTumorVasculature",
            "display": "Approximately 90%% of palpable breast masses (masses that can be felt) are benign and are not cancer. The most common cause of a breast mass is fibrocystic or normal tissue. The next most common causes are cysts and fibroadenomas. ... Breast masses are categorized as being solid or cystic. An angiolipoma is essentially a breast lipoma (or fat tissue tumor) with prominent vascular features, while a hemangioma is pretty much just a buildup of blood vessels. ... The location of the vascular breast tumor can often be indicative of it's malignant or benign nature"
          },
          {
            "code": "MassSolid",
            "display": "Approximately 90%% of palpable breast masses (masses that can be felt) are benign and are not cancer. The most common cause of a breast mass is fibrocystic or normal tissue. The next most common causes are cysts and fibroadenomas. ... Breast masses are categorized as being solid or cystic."
          },
          {
            "code": "LymphNodePathological",
            "display": "Pain or swelling in the lymph nodes is a common symptom of cancer that starts in the lymphatic system, such as non-Hodgkin lymphoma and Hodgkin lymphoma. Cancer that starts in another part of the body and spreads to the lymph nodes is called metastasis."
          },
          {
            "code": "LymphNodeNormal",
            "display": "Nodes are generally considered to be normal if they are up to 1 cm in diameter; however, some authors suggest that epitrochlear nodes larger than 0.5 cm or inguinal nodes larger than 1.5 cm should be considered abnormal.7,8 Little information exists to suggest that a specific diagnosis can be based on node size."
          },
          {
            "code": "LymphNodeEnlarged",
            "display": "When cancer has spread to the axillary lymph nodes, the nodes may feel enlarged, or there may be a noticeable lump. A breast cancer prognosis is better when the cancer is only in the breast, and the lymph nodes are not affected. Most people who have enlarged axillary lymph nodes do not have cancer at all."
          },
          {
            "code": "LymphNode",
            "display": "lymph node (limf node) A small bean-shaped structure that is part of the body's immune system. Lymph nodes filter substances that travel through the lymphatic fluid, and they contain lymphocytes (white blood cells) that help the body fight infection and disease."
          },
          {
            "code": "LumpectomySite",
            "display": "The area of the breast that is being removed."
          },
          {
            "code": "LumpectomyCavity",
            "display": "The mass is removed plus the layer of healthy breast tissue called the margin this preserves most of the breast and the hole that is left is the cavity."
          },
          {
            "code": "Lipoma",
            "display": "A lipoma is a slow-growing, fatty lump that's most often situated between your skin and the underlying muscle layer."
          },
          {
            "code": "IntramammaryNode",
            "display": "However, the clinical significance of a metastatic intramammary node is not well established. Intramammary lymph nodes (IMLN) have been reported in approximately 5%% of patients undergoing mammography (2). Although they can be seen in any quadrant, they are most commonly located in the upper outer quadrant (3)."
          },
          {
            "code": "Papilloma",
            "display": "A papilloma (plural papillomas or papillomata) (papillo- + -oma) is a benign epithelial tumor growing exophytically (outwardly projecting) in nipple-like and often finger-like fronds. In this context, papilla refers to the projection created by the tumor, not a tumor on an already existing papilla (such as the nipple)."
          },
          {
            "code": "PhyllodesTumor",
            "display": "PhyllodesTumor"
          },
          {
            "code": "PostLumpectomyScar",
            "display": "Side effects of BCS may include pain, a scar and/or dimple where the tumor was removed, a firm or hard surgical scar, and sometimes lymphedema, a type of swelling, in the arm."
          },
          {
            "code": "PostSurgicalScar",
            "display": "Side effects of BCS may include pain, a scar and/or dimple where the tumor was removed, a firm or hard surgical scar, and sometimes lymphedema, a type of swelling, in the arm."
          },
          {
            "code": "Trauma",
            "display": "hysical trauma is a serious injury to the body. Two main types of physical trauma are: Blunt force trauma—when an object or force strikes the body, often causing concussions, deep cuts, or broken bones. Penetrating trauma—when an object pierces the skin or body, usually creating an open wound."
          },
          {
            "code": "Surgery",
            "display": "The treatment of injuries or disorders of the body by incision or manipulation, especially with instruments."
          },
          {
            "code": "SkinLesion",
            "display": "A skin lesion is an abnormal lump, bump, ulcer, sore or colored area on the skin. Common skin lesions include moles and actinic keratosis, among others."
          },
          {
            "code": "Seroma",
            "display": "A seroma is a pocket of clear serous fluid that sometimes develops in the body after surgery. This fluid is composed of blood plasma that has seeped out of ruptured small blood vessels and inflammatory fluid produced by the injured and dying cells."
          },
          {
            "code": "SentinelNode",
            "display": "A sentinel lymph node is defined as the first lymph node to which cancer cells are most likely to spread from a primary tumor. Sometimes, there can be more than one sentinel lymph node."
          },
          {
            "code": "SecretoryCalcification",
            "display": "Secretory calcifications are large rod-like calcifications that are often seen in a linear or segmental distribution. They can often be easily differentiated from more malignant-appearing calcifications because they are smooth and much coarser than calcifications seen with ductal carcinoma in situ (DCIS)."
          },
          {
            "code": "SclerosingAdenosis",
            "display": "Sclerosing adenosis is a benign breast condition that may occur as the result of the normal ageing process. Breasts are made up of lobules (milk-producing glands) and ducts (tubes that carry milk to the nipple), which are surrounded by glandular, fibrous and fatty tissue."
          },
          {
            "code": "IntracysticLesion",
            "display": "Intracystic papillary carcinoma is a rare malignant tumor of the breast. It occurs communally in postmenopausal women. Clinically it can be asymptomatic or manifested by a breast mass or a nipple discharge. On imaging intracystic papillary carcinoma has usually benign features."
          },
          {
            "code": "ScarWithShadowing",
            "display": "Postsurgical Scars After a benign breast biopsy, the breast tissue usually heals without residual perceptible changes. ... At sonographic evaluation, an area of posterior acoustic shadowing may be seen.1 It has been our experience that the shadowing associated with a scar often has shadowing without a central mass."
          },
          {
            "code": "ResolvingHematoma",
            "display": "ResolvingHematoma"
          },
          {
            "code": "RadiationTherapy",
            "display": "Radiation therapy is a type of cancer treatment that uses beams of intense energy to kill cancer cells. Radiation therapy most often uses X-rays, but protons or other types of energy also can be used. The term 'radiation therapy' most often refers to external beam radiation therapy."
          },
          {
            "code": "RadiationChanges",
            "display": "Most skin changes get better within a few months. Changes to the breast tissue usually go away in 6 to 12 months, but it can take longer. ... Women who have had breast radiation may have problems breastfeeding later on. Radiation to the breast can sometimes damage some of the nerves to the arm."
          },
          {
            "code": "RadialScar",
            "display": "A radial scar is a growth that looks like a scar when the tissue is viewed under a microscope. It has a central core containing benign ducts. ... When radial scars are large enough to be picked up by a mammogram, they can look like breast cancer."
          },
          {
            "code": "PreviousTrauma",
            "display": "Some people may believe that a breast injury could lead to cancer because breast injuries can cause a lump to develop after an injury. But a lump could be due to what is called fat necrosis. ... A lump in the breast after an injury can also be due to a deep bruise that is known as a hematoma."
          },
          {
            "code": "PreviousSurgery",
            "display": "Past surgical history of the patient."
          },
          {
            "code": "PreviousBiopsy",
            "display": "PreviousBiopsy"
          },
          {
            "code": "Scar",
            "display": "A scar is an area of fibrous tissue that replaces normal skin after an injury."
          },
          {
            "code": "Inflammation",
            "display": "Inflammation"
          },
          {
            "code": "HormonalStimulation",
            "display": "he most commonly used hormone therapy drugs used to treat breast cancer are: tamoxifen. aromatase inhibitors (anastrozole, exemestane and letrozole)"
          },
          {
            "code": "Hematoma",
            "display": "A breast hematoma is a collection of blood that forms under the skin's surface. It's not unlike having a large bruise in your breast. The mass it forms is not cancerous, but it can sometimes lead to inflammation, fever, skin discoloration, and may leave behind scar tissue that mimics the shape of a breast tumor."
          },
          {
            "code": "CystSimple",
            "display": "The cyst usually contains only fluid, and it is surrounded by a very thin wall."
          },
          {
            "code": "CystSebaceous",
            "display": "Sebaceous cysts are common noncancerous cysts of the skin. Cysts are abnormalities in the body that may contain liquid or semiliquid material. Sebaceous cysts are mostly found on the face, neck, or torso."
          },
          {
            "code": "CystOil",
            "display": "Breast oil cysts are benign breast lumps that usually don't require treatment."
          },
          {
            "code": "CystComplicated",
            "display": "Simple, complicated and clustered cysts are typically benign; however, complex cystic masses containing mixed cystic and solid components are indeterminate."
          },
          {
            "code": "CystComplex",
            "display": "Complicated cysts are 'in between' simple and complex. Although they share most of the features of simple cysts, they tend to have some debris inside them and echo back some of the ultrasound waves."
          },
          {
            "code": "Cyst",
            "display": "Circumscribed, round or oval, fluid-filled mass with an imperceptible wall; usually bright on T2W images."
          },
          {
            "code": "ClusterOfCysts",
            "display": "A breast cyst is a benign (non-cancerous) fluid-filled sac in the breast. They are most common in pre-menopausal women and in post-menopausal women taking hormone therapy. Some cysts are too small to feel and others may be quite large and uncomfortable. Sometimes there are clusters of cysts in one breast or both."
          },
          {
            "code": "CystsComplex",
            "display": "Complicated cysts are 'in between' simple and complex. Although they share most of the features of simple cysts, they tend to have some debris inside them and echo back some of the ultrasound waves."
          },
          {
            "code": "CarcinomaKnown",
            "display": "There are many types of breast cancer. The most common types are ductal carcinoma in situ, invasive ductal carcinoma, and invasive lobular carcinoma. The type of breast cancer is determined by the specific cells in the breast that are affected. Most breast cancers are carcinomas."
          },
          {
            "code": "AxillaryLymphNode",
            "display": "Axillary lymph nodes are the lymph nodes located in the armpits. They can become enlarged in many conditions including infections, lymphomas, and breast cancers, Lymph nodes are small structures located all over the body around blood vessels that act as filters and can accumulate germs or cancer cells."
          },
          {
            "code": "AxillaryAdenopathy",
            "display": "AxillaryAdenopathy"
          },
          {
            "code": "AVM",
            "display": "AVM"
          },
          {
            "code": "AtypicalHyperplasia",
            "display": "Atypical hyperplasia is a precancerous condition that affects cells in the breast. Atypical hyperplasia describes an accumulation of abnormal cells in the breast. Atypical hyperplasia isn't cancer, but it can be a forerunner to the development of breast cancer."
          },
          {
            "code": "Artifact",
            "display": "Artifacts are either found external or internal to the breast these things  can either reduce or support imagining qualities."
          },
          {
            "code": "ApocrineMetaplasia",
            "display": "Apocrine Metaplasia is a particular kind of change in the cells and is associated with a variety of cystic breast disorders. ... Furthermore, this condition, in itself, does not increase the risk of breast cancer. Medics sometimes describe apocrine metaplasia as a 'benign epithelial alteration' of breast tissue."
          },
          {
            "code": "Angiolipoma",
            "display": "Angiolipoma is a rare type of lipoma — a growth made of fat and blood vessels that develops under your skin. Between 5 and 17 percent of lipomas are angiolipomas, according to one 2016 report. Unlike other types of lipomas, angiolipomas are often painful or tender."
          },
          {
            "code": "Carcinoma",
            "display": "Carcinoma is a type of cancer that starts in cells that make up the skin or the tissue lining organs, such as the liver or kidneys. Like other types of cancer, carcinomas are abnormal cells that divide without control. They are able to spread to other parts of the body, but don't always."
          },
          {
            "code": "VascularCalcifications",
            "display": "Parallel tracks or linear, tubular calcifications that are clearly associated with blood vessels"
          },
          {
            "code": "CystsMicroClustered",
            "display": "Clustered microcysts have been defined as lesions consisting of a cluster of tiny anechoic foci that individually are 2–3 mm with thin (< 0.5 mm) intervening septations and no discrete solid component \r\n\r\n\r\nRead More: https://www.ajronline.org/doi/full/10.2214/AJR.04.0929"
          },
          {
            "code": "DermalCalcification",
            "display": "Dermal and Epidermal Breast Calcifications. Calcifications and smaller microcalcifications are small specs or clusters of mineral deposits on breast tissues. Dermal (skin) breast calcifications are superficial and benign calcifications which are usually found on sebaceous glands of the skin."
          },
          {
            "code": "Hamartoma",
            "display": "A hamartoma is a mostly benign, focal malformation that resembles a neoplasm in the tissue of its origin."
          },
          {
            "code": "Gynecomastia",
            "display": "Gynecomastia is an enlargement or swelling of breast tissue in males. It is most commonly caused by male estrogen levels that are too high or are out of balance with testosterone levels. Enlarged Male Breast Tissue (Gynecomastia) Menu."
          },
          {
            "code": "Folliculitis",
            "display": "Folliculitis is a common skin condition in which hair follicles become inflamed. It's usually caused by a bacterial or fungal infection. At first it may look like small red bumps or white-headed pimples around hair follicles — the tiny pockets from which each hair grows."
          },
          {
            "code": "FibrousRidge",
            "display": "Strands of supportive tissue surround the breast and form a prominent ridge called the inframammary ridge."
          },
          {
            "code": "Fibrosis",
            "display": "Fibrosis and Simple Cysts in the Breast. Many breast lumps turn out to be caused by fibrosis and/or cysts, which are non-cancerous (benign) changes in breast tissue that happen in many women at some time in their lives. These changes are sometimes called fibrocystic changes, and used to be called fibrocystic disease."
          },
          {
            "code": "FibroglandularTissue",
            "display": "Scattered fibroglandular tissue refers to the density and composition of your breasts. A woman with scattered fibroglandular breast tissue has breasts made up mostly of non-dense tissue with some areas of dense tissue. About 40 percent of women have this type of breast tissue."
          },
          {
            "code": "FibrocysticChange",
            "display": "Fibrocystic breast disease, commonly called fibrocystic breasts or fibrocystic change, is a benign (noncancerous) condition in which the breasts feel lumpy. Fibrocystic breasts aren't harmful or dangerous, but may be bothersome or uncomfortable for some women."
          },
          {
            "code": "Debris",
            "display": "Complicated cysts are 'in between' simple and complex. Although they share most of the features of simple cysts, they tend to have some debris inside them and echo back some of the ultrasound waves."
          },
          {
            "code": "FibroadenomaDegenerating",
            "display": "Predominant cystic degeneration of the tumor that grossly constitutes most of the tumor, so called 'cystic fibroadenoma,' is rare."
          },
          {
            "code": "Fibroadenolipoma",
            "display": "Breast hamartoma is an uncommon breast tumor that accounts for approximately 4.8%% of all benign breast masses (1) and that contains lobular breast tissue involving various fibrous, fibrocystic and adipose tissues (2)."
          },
          {
            "code": "FatNecrosis",
            "display": "Fat necrosis is a lump of dead or damaged breast tissue that sometimes appears after breast surgery, radiation, or another trauma. Fat necrosis is harmless and doesn't increase your cancer risk. It usually isn't painful, but it can cause anxiety. You should tell your doctor about any lumps you feel in your breast."
          },
          {
            "code": "FatLobule",
            "display": "Breasts are made up of lobules, ducts, and fatty and fibrous connective tissue. Lobules produce milk and are often called glandular tissue. Ducts are the tiny tubes that carry milk from the lobules to the nipple. Fibrous tissue and fat give breasts their size and shape and hold the other tissues in place."
          },
          {
            "code": "Edema",
            "display": "Breast edema usually involves both skin and breast parenchyma. Stromal infiltration and lymphatic obstruction with edema causes the so-called 'Peau d'orange' sign."
          },
          {
            "code": "DuctalFluid",
            "display": "DuctalFluid"
          },
          {
            "code": "DuctalCarcinomaInSituDCIS",
            "display": "DuctalCarcinomaInSituDCIS"
          },
          {
            "code": "DuctEctasia",
            "display": "Mammary duct ectasia occurs when a milk duct beneath the nipple becomes wider (dilated) and filled with fluid. The milk duct can then become blocked or clogged with a thick, sticky substance."
          },
          {
            "code": "Fibroadenoma",
            "display": "Fibroadenoma is the most common type of benign breast tumor, and most don't increase your risk of breast cancer. Although women of any age can develop fibroadenomas, they usually occur in younger, premenopausal women."
          },
          {
            "code": "VenousStasis",
            "display": "Venous stasis, is a condition of slow blood flow in the veins, usually of the legs. Venous stasis is a risk factor for forming blood clots in veins (venous thrombosis), as with the deep veins of the legs (deep vein thrombosis or DVT)."
          }
        ]
      }
    ]
  }
}